# SQL Cheat Sheet
SUBQUERIES |

- Connecting to Database

In [1]:
reload_ext sql

In [2]:
%%sql
postgresql://localhost/leaders

'Connected: @leaders'

In [3]:
%%sql
SELECT * FROM states

 * postgresql://localhost/leaders
13 rows affected.

[('Australia', 'Oceania', 1901, 1.88, 32.74),
 ('Brunei', 'Asia', 1984, 1.96, 6.06),
 ('Chile', 'South America', 1810, 1.8, 15.82),
 ('Egypt', 'Africa', 1922, 2.7, 14.9),
 ('Haiti', 'North America', 1804, 3.03, 2.74),
 ('India', 'Asia', 1947, 2.43, 11.58),
 ('Liberia', 'Africa', 1847, 4.64, 11.65),
 ('Norway', 'Europe', 1905, 1.93, 39.6),
 ('Oman', 'Asia', 1951, 2.75, 8.82),
 ('Portugal', 'Europe', 1143, 1.31, 34.8),
 ('Spain', 'Europe', 1492, 1.53, 38.64),
 ('Uruguay', 'South America', 1828, 2.03, 22.31),
 ('Vietnam', 'Asia', 1945, 1.7, 24.0)]

___

## 1. Subquery Inside WHERE

- Select the number of countries who's fertility_rate is less than the average

In [4]:
%%sql
SELECT name, fert_rate
FROM states
WHERE fert_rate <
        (SELECT AVG(fert_rate)
         FROM states)

 * postgresql://localhost/leaders
8 rows affected.

[('Australia', 1.88),
 ('Brunei', 1.96),
 ('Chile', 1.8),
 ('Norway', 1.93),
 ('Portugal', 1.31),
 ('Spain', 1.53),
 ('Uruguay', 2.03),
 ('Vietnam', 1.7)]

___

- Select the number of Asian countries who's fertility_rate is less than the average

In [5]:
%%sql
SELECT name, fert_rate
FROM states
WHERE continent = 'Asia'
AND fert_rate <
    (SELECT AVG(fert_rate)
     FROM states)

 * postgresql://localhost/leaders
2 rows affected.

[('Brunei', 1.96), ('Vietnam', 1.7)]

____

- Connect to countries database

In [6]:
%%sql
postgresql://localhost/countries
SELECT * FROM populations
LIMIT 2;

2 rows affected.

[(20, 'ABW', 2010, 1.704, 74.95354, 101597.0),
 (19, 'ABW', 2015, 1.647, 75.573586, 103889.0)]

___

- Which countries had high average life expectancies (at the country level) in 2015.

In [7]:
%%sql
SELECT * FROM populations
WHERE life_expectancy > 
    1.15 * (SELECT AVG(life_expectancy) FROM populations
           WHERE year = 2015)
AND year = 2015

 * postgresql://localhost/countries
   postgresql://localhost/leaders
10 rows affected.

[(21, 'AUS', 2015, 1.833, 82.45122, 23789752.0),
 (376, 'CHE', 2015, 1.54, 83.19756, 8281430.0),
 (356, 'ESP', 2015, 1.32, 83.380486, 46443992.0),
 (134, 'FRA', 2015, 2.01, 82.67073, 66538392.0),
 (170, 'HKG', 2015, 1.195, 84.278046, 7305700.0),
 (174, 'ISL', 2015, 1.93, 82.86098, 330815.0),
 (190, 'ITA', 2015, 1.37, 83.49024, 60730584.0),
 (194, 'JPN', 2015, 1.46, 83.84366, 126958470.0),
 (340, 'SGP', 2015, 1.24, 82.59512, 5535002.0),
 (374, 'SWE', 2015, 1.88, 82.551216, 9799186.0)]

___

- Cities table

In [17]:
%%sql
SELECT * FROM cities LIMIT 1

 * postgresql://localhost/countries
   postgresql://localhost/leaders
1 rows affected.

[('Abidjan', 'CIV', 4765000.0, None, 4765000.0)]

- Countries table

In [25]:
%%sql
SELECT * FROM countries LIMIT 1

 * postgresql://localhost/countries
   postgresql://localhost/leaders
1 rows affected.

[('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', 652090.0, 1919, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Kabul', 69.1761, 34.5228)]

___

- Use your knowledge of subqueries in WHERE to get the urban area population for only capital cities.

In [27]:
%%sql
SELECT name, country_code, urbanarea_pop 
FROM cities
WHERE name IN
    (SELECT capital FROM countries)  
ORDER BY urbanarea_pop DESC
LIMIT 2;

 * postgresql://localhost/countries
   postgresql://localhost/leaders
2 rows affected.

[('Beijing', 'CHN', 21516000.0), ('Dhaka', 'BGD', 14543124.0)]

___